// Task 1

// Node.js — це середовище виконання, яке дозволяє запускати JavaScript-код поза браузером
// (наприклад, на твоєму комп'ютері або сервері). Без нього JS був би обмежений лише вебсторінками.

// NPM (Node Package Manager) — це гігантська "бібліотека" та менеджер пакетів. Він дозволяє програмістам
// завантажувати готові інструменти, модулі та фреймворки (як-от React або Express), щоб не писати все з нуля.

// Task 2

// Основна різниця полягає в тому, що браузер працює з інтерфейсом користувача та DOM, тоді як Node.js має доступ
// до системних ресурсів, таких як файлова система та мережеві порти, але не має доступу до вікна браузера та HTML-елементів.

// Task 3

// app.js
// console.log("Hello from Node.js");
// const sum = (a = 2, b = 3) => a + b;
// module.exports = sum;

const sum = require("./app.js");
const result = sum(11, 3);
console.log(result);
